config.org
#+title: My Custom Config
#+author: Harsh Vyapari (harshv5094)
#+date: <2024-10-25 Fri>
#+startup: showeverything

* Table Of Contents :toc:
- [[#basic-configuration][Basic Configuration]]
  - [[#beacon-mode][Beacon Mode]]
  - [[#doom-theme][Doom theme]]
  - [[#font-family][Font Family]]
  - [[#relative-line-number][Relative Line Number]]
- [[#org-mode-settings][Org Mode Settings]]
  - [[#org-auto-tangle][Org auto tangle]]
  - [[#org-directory][Org directory]]
  - [[#org-roam-directory][Org roam directory]]

* Basic Configuration

** Beacon Mode
To find cursor anywhere
#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

** Doom theme
Setting default theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-tokyo-night)
#+end_src

** Font Family
Setting default font
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15 :weight 'regular))
#+end_src

** Relative Line Number
Enable relative line number
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

* Org Mode Settings

** Org auto tangle
~org-auto-tangle~ allows you to add the option ~#+auto_tangle: t~ in your Org file so that it automatically tangles when you save the document.
#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

(defun hv/insert-auto-tangle-tag ()
  "Insert auto-tangle in literate config."
  (interactive)
  (evil-org-open-below 1)
  (insert "#+auto_tangle: t")
  (evil-force-normal-state))

(map! :leader
      :desc "Insert auto_tangle tag" "i a" #'hv/insert-auto-tangle-tag)
#+end_src

** Org directory
Setting org directory default path
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

** Org roam directory
Setting up org roam directory default path
#+begin_src emacs-lisp
(setq org-roam-directory "~/org/roam/")
#+end_src
